#include <stdio.h> #include <stdlib.h> 
int main() { int **matrix; //оголошуємо вказівника на вказівник рядків матриці int n, m; //оголошуємо змінні типу integer - розмірність матриці (n x m) int i, j; //оголошення лічильників циклів int max; /*оголошення зміної, що буде набувати значення максимального елемента в процесі перебору*/ int s = 0; /*оголошення змінної для суми максимальних елементів*/ 
//Вводимо кількість рядків матриці printf("Введіть кільсть рядків матриці\n"); scanf("%d", &n); 
//Вводимо кількість стовпців матриці printf("Введіть кільсть стовпців матриці\n"); scanf("%d", &m); 
//Виділяємо пам'ять для вказівників рядків матриці matrix = (int**)malloc(n * sizeof(int)); 
//Заповнюжмо матрицю данними printf("Введіть дані кожного елемента матриці\n"); 
for (i = 0; i < n; i++) //цикл по рядкам матриці { 
matrix[i] = (int*)malloc(m * sizeof(int)); // виділяємо пам'ять для рядків матриці for (j = 0; j < m; j++) { //цикл по стовпцям матриці 
printf("\nmatrix[%d,%d] = ", i+1, j+1); scanf("%d", &matrix[i][j]); //вводимо по черзі елементи матриці } } 
printf("\nВведена матриця:\n"); for (i = 0; i < n; i++) { 
printf("\n"); for (j = 0; j < m; j++) printf("%d ", (*(*(matrix+i)+j))); 
} 
printf("\n"); //Шукаємо максимальний елемент кожного рядка і додаємо його в загальну суму for (i = 0; i < n; i++) { 
max =(*(*(matrix + i))); 
for (j = 0; j < m; j++) 
if ((*(*(matrix + i) + j)) > max) max =(*(*(matrix + i) + j)); s +=max; } printf("Отримана сума = %d\n", s); //Очищуємо пам'ять 
for (i = 0; i < n; i++) { 
free(matrix[i]); } 
free(matrix); 
return 0; 
} 
